
### :robot: Terraform Report
---
##### Plan: `1` to add, `0` to change, `2` to destroy

<details><summary>Show Plan</summary>

```terraform

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_firestore_database.overlays-ds will be destroyed
  # (because google_firestore_database.overlays-ds is not in configuration)
  - resource "google_firestore_database" "overlays-ds" {
      - app_engine_integration_mode       = "DISABLED" -> null
      - concurrency_mode                  = "PESSIMISTIC" -> null
      - delete_protection_state           = "DELETE_PROTECTION_DISABLED" -> null
      - deletion_policy                   = "ABANDON" -> null
      - earliest_version_time             = "2024-12-05T13:00:21.096300Z" -> null
      - etag                              = "ILX79d3XkIoDMOz22djXkIoD" -> null
      - id                                = "projects/maestro-intelligence/databases/overlays-ds" -> null
      - location_id                       = "us-central1" -> null
      - name                              = "overlays-ds" -> null
      - point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED" -> null
      - project                           = "maestro-intelligence" -> null
      - type                              = "DATASTORE_MODE" -> null
      - uid                               = "167bf9f3-3734-4861-95f6-e06719e13f57" -> null
      - version_retention_period          = "3600s" -> null
        # (3 unchanged attributes hidden)
    }

  # google_firestore_database.overlays-fs will be destroyed
  # (because google_firestore_database.overlays-fs is not in configuration)
  - resource "google_firestore_database" "overlays-fs" {
      - app_engine_integration_mode       = "DISABLED" -> null
      - concurrency_mode                  = "PESSIMISTIC" -> null
      - delete_protection_state           = "DELETE_PROTECTION_ENABLED" -> null
      - deletion_policy                   = "ABANDON" -> null
      - earliest_version_time             = "2024-12-05T13:00:18.284235Z" -> null
      - etag                              = "IIrXztzXkIoDMMulrtfXkIoD" -> null
      - id                                = "projects/maestro-intelligence/databases/overlays-fs" -> null
      - location_id                       = "us-central1" -> null
      - name                              = "overlays-fs" -> null
      - point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED" -> null
      - project                           = "maestro-intelligence" -> null
      - type                              = "FIRESTORE_NATIVE" -> null
      - uid                               = "356bfa32-9d12-4c33-92de-b83090ab5570" -> null
      - version_retention_period          = "3600s" -> null
        # (3 unchanged attributes hidden)
    }

  # google_firestore_database.sources-fs will be created
  + resource "google_firestore_database" "sources-fs" {
      + app_engine_integration_mode       = (known after apply)
      + concurrency_mode                  = (known after apply)
      + create_time                       = (known after apply)
      + delete_protection_state           = "DELETE_PROTECTION_ENABLED"
      + deletion_policy                   = "ABANDON"
      + earliest_version_time             = (known after apply)
      + etag                              = (known after apply)
      + id                                = (known after apply)
      + key_prefix                        = (known after apply)
      + location_id                       = "us-central1"
      + name                              = "sources"
      + point_in_time_recovery_enablement = "POINT_IN_TIME_RECOVERY_DISABLED"
      + project                           = "maestro-intelligence"
      + type                              = "FIRESTORE_NATIVE"
      + uid                               = (known after apply)
      + update_time                       = (known after apply)
      + version_retention_period          = (known after apply)
    }

Plan: 1 to add, 0 to change, 2 to destroy.

```
</details>


---
> This comment was generated by [Terraform Pull Request Report Generator](https://github.com/ahmadnassri/action-terraform-report) - action run [`#12180304990`](https://github.com/lessthan3/personalization/actions/runs/12180304990) - commit 30720bb993f0ba7c182270526e561d413b26bc92
